In [1]:
import pandas as pd

di = pd.read_csv('directors.tsv', sep='\t')
di.sample(5)

       item   director
598    1719  nm0000382
3939   6327  nm0481418
368    8755  nm0000217
682   26562  nm0000431
2559  36527  nm0006960

In [2]:
di.nunique()

item        5503
director    1340
dtype: int64

In [28]:
array, index = pd.factorize(di["director"])
di["director"] = array
di.groupby("item")["director"].apply(list)

item
1                [330]
2                [293]
3                [542]
4                [256]
5               [1093]
              ...
118696           [203]
118900          [1168]
118997           [855]
119141    [1032, 1313]
119145          [1174]
Name: director, Length: 5503, dtype: object

In [3]:
ge = pd.read_csv('genres.tsv', sep='\t')
ge.sample(5)

        item     genre
12819   1487     Drama
3385   32598    Comedy
9549    6624   Fantasy
9357    3388  Children
4753   62203    Horror

In [4]:
ge.nunique()

item     6807
genre      18
dtype: int64

In [27]:
array, index = pd.factorize(ge["genre"])
ge["genre"] = array
ge.groupby("item")["genre"].apply(list)

item
1         [8, 12, 13, 5, 9]
2                [8, 13, 9]
3                    [5, 6]
4                 [5, 1, 6]
5                       [5]
                ...
118700                  [1]
118900                  [1]
118997       [13, 5, 9, 15]
119141               [2, 5]
119145         [2, 8, 5, 0]
Name: genre, Length: 6807, dtype: object

In [5]:
ti = pd.read_csv('titles.tsv', sep='\t')
ti.sample(5)

       item                                              title
6641   2609              King of Masks, The (Bian Lian) (1996)
1889   1785                            King of New York (1990)
1029  27728  Ghost in the Shell 2: Innocence (a.k.a. Innoce...
4270   7345      Agent Cody Banks 2: Destination London (2004)
986    8154                              Dolce Vita, La (1960)

In [6]:
ti['a'] = ti['title'].str[:-6]
ti.nunique()

item     6807
title    6806
a        6616
dtype: int64

In [7]:
ti[ti.duplicated(subset='title')]

       item                     title                   a
1926  64997  War of the Worlds (2005)  War of the Worlds

In [8]:
ti[ti.duplicated(subset='a')]

,item,title,a
704,74789,Alice in Wonderland (2010),Alice in Wonderland
744,2366,King Kong (1933),King Kong
898,8781,"Manchurian Candidate, The (2004)","Manchurian Candidate, The"
1101,7001,Invasion of the Body Snatchers (1978),Invasion of the Body Snatchers
1111,4703,Chocolat (1988),Chocolat
...,...,...,...
6745,40962,"Yours, Mine and Ours (2005)","Yours, Mine and Ours"
6749,71460,Wanted (2009),Wanted
6781,8912,Taxi (2004),Taxi
6796,1430,Underworld (1996),Underworld
6806,8130,"Girl Next Door, The (1999)","Girl Next Door, The"

In [9]:
ti[ti['a']=='King Kong ']

       item             title           a
340   41569  King Kong (2005)  King Kong
744    2366  King Kong (1933)  King Kong
3783   2367  King Kong (1976)  King Kong

In [10]:
ti[ti['a']=='War of the Worlds ']

       item                     title                   a
349   34048  War of the Worlds (2005)  War of the Worlds
1926  64997  War of the Worlds (2005)  War of the Worlds

In [11]:
ge[ge.item==64997], ge[ge.item==34048]

(       item   genre
 4735  64997  Action
 4736  64997  Sci-Fi,
        item      genre
 1001  34048     Action
 1002  34048  Adventure
 1003  34048     Sci-Fi
 1004  34048   Thriller)

In [12]:
di[di.item==64997], di[di.item==34048]

(Empty DataFrame
 Columns: [item, director]
 Index: [],
       item   director
 384  34048  nm0000229)

In [13]:
wr = pd.read_csv('writers.tsv', sep='\t')
wr.sample(5)

        item     writer
1565     788  nm0001723
5287   26064  nm0368074
6378   86548  nm0481418
10660   5785  nm1035634
7721   37477  nm0643315

In [14]:
wr.nunique()

item      5648
writer    2989
dtype: int64

In [15]:
wr[wr.item==64997], wr[wr.item==34048]

(        item     writer
 10158  64997  nm0920229,
         item     writer
 4527   34048  nm0295264
 6221   34048  nm0462895
 10154  34048  nm0920229)

In [16]:
ye = pd.read_csv('years.tsv', sep='\t')
ye.sample(5)

        item  year
6427   87485  2011
6684  103141  2013
3658    3273  2000
6397   87876  2011
4831   37727  2005

In [17]:
ye.nunique()

item    6799
year      93
dtype: int64

In [29]:
df = pd.read_csv('train_ratings.csv')

In [30]:
df['t'] = df['time'].apply(lambda x : time.strftime('%Y', time.localtime(x)))
df.groupby('t')['time'].count()

t
2005    572894
2006    647240
2007    589945
2008    679269
2009    517366
2010    510385
2011    427103
2012    421942
2013    338109
2014    308281
2015    141937
Name: time, dtype: int64

In [52]:
import time
a = df.groupby('user')['time'].min().to_frame()
b = df.groupby('user')['time'].max().to_frame()
a['time'] = a['time'].apply(lambda x : time.strftime('%Y', time.localtime(x)))
b['time'] = b['time'].apply(lambda x : time.strftime('%Y', time.localtime(x)))

In [21]:
a.groupby('time')['time'].count()
# 신규 유저 -> sequence 길이가 짧음 -> 제거 대상 -> 따라서 연도가 지나면서 유저 수가 줄어듦 -> 따라서 연도별 interection도 줄어듦
# 뒤 늦게 참여한 user는 제거 대상에 해당 안된 친구들이니 (sequence길이가 일정 이상) interection의 밀도가 높을 것임

time
2005    5263
2006    3690
2007    3351
2008    4026
2009    2954
2010    2948
2011    2426
2012    2321
2013    1897
2014    1718
2015     766
Name: time, dtype: int64

In [32]:
b.groupby('time')['time'].count()

time
2005    2147
2006    2950
2007    3001
2008    3528
2009    2960
2010    2974
2011    2750
2012    2887
2013    2625
2014    3006
2015    2532
Name: time, dtype: int64

In [22]:
a = df.groupby(['user', 'item'])['time'].count().to_frame()
a[a['time'] != 1] # 똑같은 영화를 본 data 없음.

Empty DataFrame
Columns: [time]
Index: []

In [95]:
import re
def year(s):
    s = s.split('(')
    answer = []
    for i in s:
        if ')' not in i:
            continue
        a = re.sub(r'[^0-9]', '', i)
        if len(a) == 4:
            return a
ti['year'] = ti['title'].apply(year)
t = ti[['item', 'year']]

In [101]:
w = [119145,  91535,  89745,  99007]
for i in w:
    print(ti[ti.item==i])

        item                                title  \
6043  119145  Kingsman: The Secret Service (2015)

                                  a  year
6043  Kingsman: The Secret Service   2015
       item                      title                    a  year
5908  91535  Bourne Legacy, The (2012)  Bourne Legacy, The   2012
       item                 title               a  year
2933  89745  Avengers, The (2012)  Avengers, The   2012
       item               title             a  year
5528  99007  Warm Bodies (2013)  Warm Bodies   2013

In [102]:
ti[ti.item==119145]

,item,title,a,year
6043,119145,Kingsman: The Secret Service (2015),Kingsman: The Secret Service,2015

In [98]:
df = pd.merge(df, t, on='item', how='left')
df

           user   item        time     t  year
0            11   4643  1230782529  2009  2001
1            11    170  1230782534  2009  1995
2            11    531  1230782539  2009  1993
3            11    616  1230782542  2009  1970
4            11   2140  1230782563  2009  1982
...         ...    ...         ...   ...   ...
5154466  138493  44022  1260209449  2009  2006
5154467  138493   4958  1260209482  2009  2001
5154468  138493  68319  1260209720  2009  2009
5154469  138493  40819  1260209726  2009  2005
5154470  138493  27311  1260209807  2009  2000

[5154471 rows x 5 columns]

In [55]:
df.groupby('user')['t'].max()

user
11        2011
14        2008
18        2010
25        2010
31        2015
          ...
138473    2010
138475    2005
138486    2008
138492    2005
138493    2009
Name: t, Length: 31360, dtype: object

In [99]:
last = df.groupby('user').last()
last[last.t >= last.year]

         item        time     t  year
user
11       4226  1294796159  2011  2000
14        468  1225320550  2008  1995
18      71033  1283426140  2010  2009
25      52319  1277964502  2010  1978
31       5621  1424737127  2015  2002
...       ...         ...   ...   ...
138473   3578  1274234532  2010  2000
138475   6611  1128233734  2005  1952
138486   6502  1207076820  2008  2002
138492   3210  1115351445  2005  1982
138493  27311  1260209807  2009  2000

[31359 rows x 4 columns]

In [65]:
31325/31360

0.9988839285714286

In [68]:
len(df[df.t >= df.year]) / len(df)

0.9987457490788094

In [69]:
len(df[df.t > df.year]) / len(df)

0.9660923497290023

In [103]:
df[df.t < df.year]#.item.unique()

           user    item        time     t  year
2404686   63880  119145  1419022975  2014  2015
3064009   81663   91535  1323223207  2011  2012
4617327  123609   89745  1316645274  2011  2012
4646140  124413   99007  1355791816  2012  2013

In [105]:
sub = pd.read_csv('../eval/sample_submission.csv')
sub.nunique()

user    31360
item       10
dtype: int64

In [120]:
genres_df = pd.read_csv("genres.tsv", sep="\t")
item2label = {j:i+1 for i,j in enumerate(sorted(genres_df['item'].unique()))}
genres_df['item'] = genres_df['item'].map(item2label)
array, index = pd.factorize(genres_df["genre"])
genres_df["genre"] = [i+1 for i in array]
genres_df

       item  genre
0       194      1
1       194      2
2      1436      3
3      1436      4
4      1436      5
...     ...    ...
15928  6735      2
15929  3980      3
15930  3980      6
15931  2028      6
15932  3857     18

[15933 rows x 2 columns]

In [204]:
ti = pd.read_csv('titles.tsv', sep='\t')
ge = pd.read_csv("genres.tsv", sep="\t")
def year(s):
    s = s.split('(')
    answer = []
    for i in s:
        if ')' not in i:
            continue
        a = re.sub(r'[^0-9]', '', i)
        if len(a) == 4:
            return a
ti['year'] = ti['title'].apply(year)
ti = ti[['item', 'year']]
for i in range(len(ti)):
    print(ti.groupby('year').count().index[i], ti.groupby('year').count().values[i])

1902 [1]
1915 [1]
1916 [1]
1917 [1]
1919 [1]
1920 [1]
1921 [1]
1922 [3]
1923 [2]
1924 [5]
1925 [6]
1926 [2]
1927 [5]
1928 [6]
1929 [5]
1930 [4]
1931 [10]
1932 [9]
1933 [12]
1934 [8]
1935 [8]
1936 [13]
1937 [14]
1938 [13]
1939 [27]
1940 [20]
1941 [18]
1942 [19]
1943 [10]
1944 [17]
1945 [19]
1946 [18]
1947 [19]
1948 [25]
1949 [22]
1950 [22]
1951 [19]
1952 [18]
1953 [31]
1954 [24]
1955 [37]
1956 [26]
1957 [27]
1958 [28]
1959 [32]
1960 [33]
1961 [25]
1962 [38]
1963 [29]
1964 [38]
1965 [37]
1966 [37]
1967 [35]
1968 [32]
1969 [28]
1970 [33]
1971 [43]
1972 [44]
1973 [49]
1974 [39]
1975 [35]
1976 [38]
1977 [43]
1978 [44]
1979 [53]
1980 [52]
1981 [60]
1982 [63]
1983 [62]
1984 [69]
1985 [88]
1986 [87]
1987 [95]
1988 [106]
1989 [100]
1990 [100]
1991 [94]
1992 [121]
1993 [132]
1994 [138]
1995 [158]
1996 [166]
1997 [159]
1998 [175]
1999 [192]
2000 [197]
2001 [222]
2002 [242]
2003 [236]
2004 [262]
2005 [260]
2006 [284]
2007 [271]
2008 [256]
2009 [247]
2010 [213]
2011 [185]
2012 [140]
2013 [134]
2014 [76]
2015 [1]

IndexError: index 101 is out of bounds for axis 0 with size 101

In [223]:
ti = pd.read_csv('titles.tsv', sep='\t')
ti[ti['item']==108583]

        item                      title
5204  108583  Fawlty Towers (1975-1979)

In [222]:
ti[ti['item']==108583]

Empty DataFrame
Columns: [item, year]
Index: []

6719

In [228]:
import re
ti = pd.read_csv('titles.tsv', sep='\t')
ge = pd.read_csv("genres.tsv", sep="\t")
def year(s):
    if s == 'Fawlty Towers (1975-1979)':
        return 1975
    s = s.split('(')
    answer = []
    for i in s:
        if ')' not in i:
            continue
        a = re.sub(r'[^0-9]', '', i)
        if len(a) == 4:
            return a
ti['year'] = ti['title'].apply(year)

ti = ti[['item', 'year']]
def yy(y):
    y = int(y)
    if y <= 1950:
        return 1950
    elif y <= 1960:
        return 1960
    elif y <= 1970:
        return 1970
    elif y <= 1980:
        return 1980
    elif y <= 1990:
        return 1990
    elif y <= 2000:
        return 2000
    elif y <= 2005:
        return 2005
    elif y <= 2010:
        return 2010
    else:
        return 2015
item2label = {j:i+1 for i,j in enumerate(sorted(ti['item'].unique()))}
ti['item'] = ti['item'].map(item2label)

#
ti['year'] = ti['year'].apply(yy)
item2label = {j:i+1+18 for i,j in enumerate((ti['year'].unique()))}
ti['year'] = ti['year'].map(item2label)

item2label = {j:i+1 for i,j in enumerate(sorted(ge['item'].unique()))}
ge['item'] = ge['item'].map(item2label)

array, index = pd.factorize(ge["genre"])
ge["genre"] = [i+1 for i in array]

g = ge.groupby("item")["genre"].apply(list).to_frame()

g = pd.merge(g, t, on='item', how='left')

value = []

for i in range(len(g)):
    value.append(g.loc[i].genre + [g.loc[i].year])
g['genre'] = value
g = g.set_index(g.item)
g
g = g['genre']
g.to_json(
        "Ml_item2attributes.json"
    )

In [197]:
ti.groupby('year').count().values

array([[  1],
       [  1],
       [  1],
       [  1],
       [  1],
       [  1],
       [  1],
       [  3],
       [  2],
       [  5],
       [  6],
       [  2],
       [  5],
       [  6],
       [  5],
       [  4],
       [ 10],
       [  9],
       [ 12],
       [  8],
       [  8],
       [ 13],
       [ 14],
       [ 13],
       [ 27],
       [ 20],
       [ 18],
       [ 19],
       [ 10],
       [ 17],
       [ 19],
       [ 18],
       [ 19],
       [ 25],
       [ 22],
       [ 22],
       [ 19],
       [ 18],
       [ 31],
       [ 24],
       [ 37],
       [ 26],
       [ 27],
       [ 28],
       [ 32],
       [ 33],
       [ 25],
       [ 38],
       [ 29],
       [ 38],
       [ 37],
       [ 37],
       [ 35],
       [ 32],
       [ 28],
       [ 33],
       [ 43],
       [ 44],
       [ 49],
       [ 39],
       [ 35],
       [ 38],
       [ 43],
       [ 44],
       [ 53],
       [ 52],
       [ 60],
       [ 63],
       [ 62],
       [ 69],
       [ 88],
       [ 87],
       [ 95],
       [106],
       [100],
       [100],
       [ 94],
       [121],
       [132],
       [138],
       [158],
       [166],
       [159],
       [175],
       [192],
       [197],
       [222],
       [242],
       [236],
       [262],
       [260],
       [284],
       [271],
       [256],
       [247],
       [213],
       [185],
       [140],
       [134],
       [ 76],
       [  1]])

In [198]:
ti = pd.read_csv('titles.tsv', sep='\t')
def year(s):
    s = s.split('(')
    answer = []
    for i in s:
        if ')' not in i:
            continue
        a = re.sub(r'[^0-9]', '', i)
        if len(a) == 4:
            return a
ti['year'] = ti['title'].apply(year)
ti = ti[['item', 'year']]
ti.groupby('year').count().values

array([[  1],
       [  1],
       [  1],
       [  1],
       [  1],
       [  1],
       [  1],
       [  3],
       [  2],
       [  5],
       [  6],
       [  2],
       [  5],
       [  6],
       [  5],
       [  4],
       [ 10],
       [  9],
       [ 12],
       [  8],
       [  8],
       [ 13],
       [ 14],
       [ 13],
       [ 27],
       [ 20],
       [ 18],
       [ 19],
       [ 10],
       [ 17],
       [ 19],
       [ 18],
       [ 19],
       [ 25],
       [ 22],
       [ 22],
       [ 19],
       [ 18],
       [ 31],
       [ 24],
       [ 37],
       [ 26],
       [ 27],
       [ 28],
       [ 32],
       [ 33],
       [ 25],
       [ 38],
       [ 29],
       [ 38],
       [ 37],
       [ 37],
       [ 35],
       [ 32],
       [ 28],
       [ 33],
       [ 43],
       [ 44],
       [ 49],
       [ 39],
       [ 35],
       [ 38],
       [ 43],
       [ 44],
       [ 53],
       [ 52],
       [ 60],
       [ 63],
       [ 62],
       [ 69],
       [ 88],
       [ 87],
       [ 95],
       [106],
       [100],
       [100],
       [ 94],
       [121],
       [132],
       [138],
       [158],
       [166],
       [159],
       [175],
       [192],
       [197],
       [222],
       [242],
       [236],
       [262],
       [260],
       [284],
       [271],
       [256],
       [247],
       [213],
       [185],
       [140],
       [134],
       [ 76],
       [  1]])

In [230]:
df = pd.read_csv('train_ratings.csv')
df.sort_values(by=['user','item']).to_csv('df2.csv',index=False)

In [231]:
!nvidia-smi

Fri Dec 16 17:43:56 2022
+-----------------------------------------------------------------------------+
| NVIDIA-SMI 450.80.02    Driver Version: 450.80.02    CUDA Version: 11.0     |
|-------------------------------+----------------------+----------------------+
| GPU  Name        Persistence-M| Bus-Id        Disp.A | Volatile Uncorr. ECC |
| Fan  Temp  Perf  Pwr:Usage/Cap|         Memory-Usage | GPU-Util  Compute M. |
|                               |                      |               MIG M. |
|===============================+======================+======================|
|   0  Tesla V100-SXM2...  Off  | 00000000:00:05.0 Off |                  Off |
| N/A   39C    P0    64W / 300W |  19363MiB / 32510MiB |      0%      Default |
|                               |                      |                  N/A |
+-------------------------------+----------------------+----------------------+

+-----------------------------------------------------------------------------+
| Processes:                                                                  |
|  GPU   GI   CI        PID   Type   Process name                  GPU Memory |
|        ID   ID                                                   Usage      |
|=============================================================================|
+-----------------------------------------------------------------------------+